---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CouplerMainBarSize
source: html/f61fe6bf-dff1-26f4-51ff-34880e4bfc81.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CouplerMainBarSize Property

"Bar Size 1"

## Syntax (C#)
```csharp
public static ForgeTypeId CouplerMainBarSize { get; }
```